<?php
if (!isset($bad_words_arabic)) {
    $bad_words_arabic = array();
}

$temp = array(
    "سكس",
    "طيز",
    "شرج",
    "لعق",
    "لحس",
    "مص",
    "تمص",
    "بيضان",
    "ثدي",
    "بز",
    "بزاز",
    "حلمة",
    "مفلقسة",
    "بظر",
    "كس",
    "فرج",
    "شهوة",
    "شاذ",
    "مبادل",
    "عاهرة",
    "جماع",
    "قضيب",
    "زب",
    "لوطي",
    "لواط",
    "سحاق",
    "سحاقية",
    "اغتصاب",
    "خنثي",
    "احتلام",
    "نيك",
    "متناك",
    "متناكة",
    "شرموطة",
    "عرص",
    "خول",
    "قحبة",
    "لبوة"
);
$bad_words_arabic = array_merge($bad_words_arabic, $temp);
