<?php
// full array search required
if (!isset($bad_words_arabic)) {
    $bad_words_arabic = array();
}

$temp = array(
    "آب کیر",
    "ارگاسم",
    "برهنه",
    "پورن",
    "پورنو",
    "تجاوز",
    "تخمی",
    "جق",
    "جقی",
    "جلق",
    "جنده",
    "چوچول",
    "حشر",
    "حشری",
    "داف",
    "دودول",
    "ساک زدن",
    "سکس",
    "سکس کردن",
    "سکسی",
    "سوپر",
    "شق کردن",
    "شهوت",
    "شهوتی",
    "شونبول",
    "فیلم سوپر",
    "کس",
    "کس دادن",
    "کس کردن",
    "کسکش",
    "کوس",
    "کون",
    "کون دادن",
    "کون کردن",
    "کونکش",
    "کونی",
    "کیر",
    "کیری",
    "لاپا",
    "لاپایی",
    "لاشی",
    "لخت",
    "لش",
    "منی",
    "هرزه"
);
$bad_words_arabic = array_merge($bad_words_arabic, $temp);
