<?php
if (!isset($bad_words)) {
    $bad_words = array();
}

$temp = array('กระดอ' => 0, 'กระเด้า' => 1, 'กระหรี่' => 2, 'กะปิ' => 3, 'กู' => 4, 'ขี้' => 5, 'ควย' => 6, 'จิ๋ม' => 7, 'จู๋' => 8, 'เจ๊ก' => 9, 'เจี๊ยว' => 10, 'ดอกทอง' => 11, 'ตอแหล' => 12, 'ตูด' => 13, 'น้ําแตก' => 14, 'มึง' => 15, 'แม่ง' => 16, 'เย็ด' => 17, 'รูตูด' => 18, 'ล้างตู้เย็น' => 19, 'ส้นตีน' => 20, 'สัด' => 21, 'เสือก' => 22, 'หญิงชาติชั่ว' => 23, 'หลั่ง' => 24, 'ห่า' => 25, 'หํา' => 26, 'หี' => 27, 'เหี้ย' => 28, 'อมนกเขา' => 29, 'ไอ้ควาย' => 30,);
// add temp to bad words
$bad_words = array_merge($bad_words, $temp);